# Data Cleaning and Preparation

## 7.2 Data Transformation

#### Removing Duplicates

In [2]:
import pandas as pd
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [3]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [5]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [7]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

#### Transforming Data Using a Function or Mapping

In [8]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [9]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [11]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [12]:
# data['food'].map(lambda x: meat_to_animal[x.lower()])

#### Replacing Values

In [13]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [15]:
import numpy as np
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [17]:
data.replace([-999, -1000], [np.nan, 12500])

0        1.0
1        NaN
2        2.0
3        NaN
4    12500.0
5        3.0
dtype: float64

In [18]:
data.replace({-999: np.nan, -1000: 10})

0     1.0
1     NaN
2     2.0
3     NaN
4    10.0
5     3.0
dtype: float64

#### Renaming Axis Indexes

In [19]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [20]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [21]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [22]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [23]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [24]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [25]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### Discretization and Binning

In [26]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [27]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [28]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [29]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [30]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [31]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [32]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [33]:
data = np.random.rand(20)

In [34]:
pd.cut(data, 4, precision=2)

[(0.75, 0.99], (0.26, 0.5], (0.012, 0.26], (0.26, 0.5], (0.75, 0.99], ..., (0.26, 0.5], (0.75, 0.99], (0.75, 0.99], (0.012, 0.26], (0.012, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.012, 0.26] < (0.26, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [35]:
data = np.random.randn(1000) # Normally distributed

In [36]:
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(0.686, 3.302], (-2.735, -0.651], (0.686, 3.302], (0.686, 3.302], (0.0514, 0.686], ..., (-0.651, 0.0514], (0.686, 3.302], (0.0514, 0.686], (0.686, 3.302], (0.686, 3.302]]
Length: 1000
Categories (4, interval[float64]): [(-2.735, -0.651] < (-0.651, 0.0514] < (0.0514, 0.686] < (0.686, 3.302]]

In [37]:
pd.value_counts(cats)

(0.686, 3.302]      250
(0.0514, 0.686]     250
(-0.651, 0.0514]    250
(-2.735, -0.651]    250
dtype: int64

In [38]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0514, 1.315], (-1.252, 0.0514], (0.0514, 1.315], (1.315, 3.302], (0.0514, 1.315], ..., (-1.252, 0.0514], (0.0514, 1.315], (0.0514, 1.315], (1.315, 3.302], (1.315, 3.302]]
Length: 1000
Categories (4, interval[float64]): [(-2.735, -1.252] < (-1.252, 0.0514] < (0.0514, 1.315] < (1.315, 3.302]]

#### Detecting and Filtering Outliers

In [39]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [40]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.069216    -0.027828     0.009813     0.006423
std       0.981458     0.977815     1.008401     1.006608
min      -3.302999    -3.041376    -3.636711    -3.168408
25%      -0.588687    -0.709426    -0.627071    -0.681631
50%       0.093551    -0.011166    -0.017817     0.012368
75%       0.722470     0.604381     0.677762     0.720539
max       3.407470     3.395716     3.649941     3.378867

In [41]:
col = data[2]

In [42]:
col[np.abs(col) > 3]

70     3.072123
207   -3.171245
217   -3.636711
376   -3.277148
814    3.649941
825    3.079949
877   -3.100627
Name: 2, dtype: float64

In [43]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
39  -1.170904  1.370372  0.784700  3.378867
70   0.936651 -1.201802  3.072123  0.406797
127  3.237256 -0.456582 -1.142158  1.186366
137  0.249191  3.395716 -0.813844  0.094875
141 -0.383800 -3.041376  0.102338 -0.887106
207 -1.254912 -0.987221 -3.171245  1.228419
217  0.166135  0.326265 -3.636711 -0.795233
227 -0.787317 -1.194322 -0.075329 -3.054944
376  0.877801  2.833589 -3.277148 -1.313008
419  0.389871 -0.159244 -0.662319  3.349093
600 -3.302999  0.435641  2.849201  0.394678
640  0.805636  0.885124  1.776206 -3.143414
665  0.716056 -0.539229 -1.446029 -3.168408
814  1.907904  0.754038  3.649941 -0.154692
825  0.284460 -1.616733  3.079949 -0.096094
848 -1.605645 -0.938630 -0.742028 -3.065190
867  3.407470  0.069938 -0.342945 -1.368351
877 -0.414698  1.225338 -3.100627 -1.709605

In [44]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [45]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.068874    -0.028182     0.010196     0.006127
std       0.978417     0.976380     1.001983     1.002983
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.588687    -0.709426    -0.627071    -0.681631
50%       0.093551    -0.011166    -0.017817     0.012368
75%       0.722470     0.604381     0.677762     0.720539
max       3.000000     3.000000     3.000000     3.000000

In [46]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0  1.0  1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0  1.0 -1.0  1.0
4  1.0  1.0 -1.0 -1.0

#### Permutation and Random Sampling

In [47]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 1, 0, 3, 2])

In [48]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [49]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [50]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [51]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
4    4
3    6
3    6
3    6
4    4
1    7
0    5
3    6
1    7
dtype: int64

#### Computing Indicator/Dummy Variables

In [52]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [53]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [54]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',header=None, names=mnames)
movies[:10]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'